{
  "title": "Professional Experience",
  "subtitle": "Over 15 years of progressive leadership in systems engineering, from hands-on development to executive technical strategy.",
  "experiences": [
    {
      "company": "Solace",
      "logo": "images/Solace-logo.svg",
      "position": "Vice President of Systems/PreSales Engineering, Americas",
      "location": "Remote",
      "period": "2018 - Present",
      "description": "Promoted to VP role with mandate to scale team, increase technical wins, contribute to product strategy, build product, lead partnership efforts and be a technical evangelist.",
      "achievements": [
        "Scaled the Systems Engineering organization 3x (5 to 15 headcount) while maintaining culture and delivery velocity. Established hiring frameworks and mentorship programs to upskill the team on modern architectures.",
        "Partnered with Sales leadership to open high-value verticals (Airlines, Manufacturing, SaaS), aligning technical pre-sales engineering with GTM strategy to exceed regional revenue targets.",
        "Played a key role, with both architecture guidance and hands on coding, in the delivery of critical connectors (Databricks, Snowflake, GraphQL, DAPR). These integrations expanded the platform's Total Addressable Market (TAM) and reduced customer friction.",
        "Served as Executive Sponsor for strategic alliances with major hyperscalers (AWS, GCP, Azure) and data platforms (Snowflake, Databricks). Facilitated high-level technical engagements to drive co-sell opportunities and ecosystem compatibility.",
        "Helped define the company's voice on Event-Driven Architecture as a featured speaker at Tier-1 industry conferences (AWS re:Invent, EDA Summit) and podcasts, strengthening brand authority and developer relations.",
        "Leading the Solutions Engineering effort in the Americas for Solace Agent Mesh, our breakthrough Agentic AI solution. Involved with market analysis, competitive positioning, product-market fit validation, and scaling the specialized team to support this next-generation AI infrastructure platform."
      ],
      "technologies": [
        "Event Driven Architecture",
        "AWS",
        "Snowflake",
        "DAPR",
        "GraphQL",
        "Microservices"
      ]
    },
    {
      "company": "CapitalOne",
      "logo": "images/Capital_One-Logo.png",
      "position": "Software Development Manager",
      "location": "New York",
      "period": "2017 - 2018",
      "description": "Manager for a new team of engineers building microservices in AWS using agile methodologies for the upmarket credit card business.",
      "achievements": [
        "Architected a high-performance microservices layer in GoLang to streamline integrations with fintech startups, accelerating the bank’s partnership ecosystem and reducing vendor onboarding time.",
        "Engineered mission-critical Java Spring Boot services for credit card controls, delivering real-time restriction capabilities that enhanced risk management and regulatory compliance.",
        "Designed scalable, event-driven architectures for identity verification. Implemented batch processing strategies to handle high-volume authentication triggers efficiently.",
        "Piloted the engineering internship program for the team, mentoring a team of three developers. Successfully guided the cohort to deliver internal communication tooling (SNS/Slack) used for operational alerts."
      ],
      "technologies": [
        "GoLang",
        "Java",
        "Spring Boot",
        "AWS",
        "Jenkins",
        "Microservices",
        "REST APIs"
      ]
    },
    {
      "company": "Deutsche Bank",
      "logo": "images/Deutsche_Bank-logo.png",
      "position": "Vice President, Lead Messaging Middleware Specialist",
      "location": "New York",
      "period": "2008 - 2017",
      "description": "Lead for enterprise messaging middleware group supporting mission critical real-time trading systems. Multi-disciplinary role encompassing client management, technical expertise, and application development.",
      "achievements": [
        "Spearheaded the firm-wide migration from legacy TIBCO Rendezvous to Solace messaging infrastructure. This multi-year initiative modernized the bank's trading backbone, significantly reducing latency and infrastructure TCO (Total Cost of Ownership).",
        "Architected and delivered internal middleware management platforms, reducing operational toil and providing self-service capabilities to global application teams.",
        "Served as the Front Office Technology Lead for graduate and intern recruitment, establishing the hiring rubric and mentoring the next generation of fintech engineers.",
        "Engineered low-latency trading support solutions using Core Java and KDB+, ensuring real-time visibility into complex trading environments."
      ],
      "technologies": [
        "TIBCO Rendezvous",
        "Solace",
        "Core Java",
        "KDB",
        "Aurelia JS",
        "Informatica UltraMessaging"
      ]
    }
  ]
}